docs/cpp/boost.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2021-03-10 Wed 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>boost cookbook</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="c++, boost" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">boost cookbook</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfcb25bb">1. Data Structure</a>
<ul>
<li><a href="#orgaaef019">1.1. any</a></li>
<li><a href="#org3f7d69c">1.2. variant</a></li>
<li><a href="#org6383d1b">1.3. optional</a></li>
<li><a href="#orgc1e99cd">1.4. tuple</a></li>
<li><a href="#org902605e">1.5. others</a></li>
</ul>
</li>
<li><a href="#org535f8e2">2. Functional</a>
<ul>
<li><a href="#orgb34c4c8">2.1. bind</a></li>
</ul>
</li>
<li><a href="#org0bda47f">3. Managing Resources</a></li>
<li><a href="#org254f9a0">4. Utilities</a>
<ul>
<li><a href="#orgc8f7d63">4.1. boost::algorithm</a></li>
<li><a href="#org15625ee">4.2. swap</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgfcb25bb" class="outline-2">
<h2 id="orgfcb25bb"><span class="section-number-2">1</span> Data Structure</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgaaef019" class="outline-3">
<h3 id="orgaaef019"><span class="section-number-3">1.1</span> any</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgc7fd30c" class="outline-4">
<h4 id="orgc7fd30c"><span class="section-number-4">1.1.1</span> how it works</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
On the assignment of some variable of type T, Boost.Any instantiates a holder&lt;T&gt; type that may store
a value of the specified type T and is derived from some base-type placeholder.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">struct</span> <span style="color: #ba2f59; font-weight: bold;">placeholder</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #3a81c3; font-weight: bold;">virtual</span> ~<span style="color: #6c3163; font-weight: bold;">placeholder</span><span style="color: #6c3163;">()</span> <span style="color: #6c3163;">{}</span>
  <span style="color: #3a81c3; font-weight: bold;">virtual</span> <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">type_info</span> &amp;<span style="color: #6c3163; font-weight: bold;">type</span><span style="color: #6c3163;">()</span> <span style="color: #3a81c3; font-weight: bold;">const</span> = 0;
<span style="color: #3a81c3;">}</span>;

<span style="color: #3a81c3; font-weight: bold;">template</span> <span style="color: #3a81c3;">&lt;</span><span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">ValueType</span><span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3; font-weight: bold;">struct</span> <span style="color: #ba2f59; font-weight: bold;">holder</span> : <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">placeholder</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #3a81c3; font-weight: bold;">virtual</span> <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">type_info</span> &amp;<span style="color: #6c3163; font-weight: bold;">type</span><span style="color: #6c3163;">()</span> <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #6c3163;">{</span> <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #3a81c3; font-weight: bold;">typeid</span><span style="color: #2d9574;">(</span>ValueType<span style="color: #2d9574;">)</span>; <span style="color: #6c3163;">}</span>
  <span style="color: #ba2f59; font-weight: bold;">ValueType</span> <span style="color: #715ab1;">held</span>;
<span style="color: #3a81c3;">}</span>;
</pre>
</div>
<p>
<code>boost::any</code> stores a pointer <code>ptr</code> to placeholder.
</p>
<ul class="org-ul">
<li><code>any_cast&lt;T&gt;()</code>: <code>ptr-&gt;type()</code> -&gt; checks <code>type_info==typeid(T)</code> -&gt; returns <code>static_cast&lt;holder&lt;T&gt;*&gt;(ptr)-&gt;held</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3f7d69c" class="outline-3">
<h3 id="org3f7d69c"><span class="section-number-3">1.2</span> variant</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Boost variant emulates a union but it does not use a union in its implementation. Instead it uses aligned storage and placement new.
You have to manage the construction and destruction of non POD types by yourself when you use C++11 unions.
</p>
</div>
<div id="outline-container-org573265b" class="outline-4">
<h4 id="org573265b"><span class="section-number-4">1.2.1</span> hints</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>To achieve maximum performance, make sure that there is a simple type in the list of supported types at the first position, such as boost::blank</li>
</ul>
</div>
</div>
<div id="outline-container-org9e53ae0" class="outline-4">
<h4 id="org9e53ae0"><span class="section-number-4">1.2.2</span> <code>boost::apply_visitor</code></h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">typedef</span> <span style="color: #4e3163;">boost</span>::<span style="color: #ba2f59; font-weight: bold;">variant</span><span style="color: #3a81c3;">&lt;</span><span style="color: #ba2f59; font-weight: bold;">int</span>, <span style="color: #ba2f59; font-weight: bold;">float</span>, <span style="color: #4e3163;">std</span>::string<span style="color: #3a81c3;">&gt;</span> <span style="color: #ba2f59; font-weight: bold;">cell_t</span>;
<span style="color: #3a81c3; font-weight: bold;">struct</span> <span style="color: #ba2f59; font-weight: bold;">db_sum_visitor</span> : <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #4e3163;">boost</span>::<span style="color: #ba2f59; font-weight: bold;">static_visitor</span><span style="color: #3a81c3;">&lt;</span><span style="color: #ba2f59; font-weight: bold;">double</span><span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #ba2f59; font-weight: bold;">double</span> <span style="color: #3a81c3; font-weight: bold;">operator</span><span style="color: #6c3163; font-weight: bold;">()</span><span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">value</span><span style="color: #6c3163;">)</span> <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #6c3163;">{</span> <span style="color: #3a81c3; font-weight: bold;">return</span> value; <span style="color: #6c3163;">}</span>
  <span style="color: #ba2f59; font-weight: bold;">double</span> <span style="color: #3a81c3; font-weight: bold;">operator</span><span style="color: #6c3163; font-weight: bold;">()</span><span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">float</span> <span style="color: #715ab1;">value</span><span style="color: #6c3163;">)</span> <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #6c3163;">{</span> <span style="color: #3a81c3; font-weight: bold;">return</span> value; <span style="color: #6c3163;">}</span>
  <span style="color: #ba2f59; font-weight: bold;">double</span> <span style="color: #3a81c3; font-weight: bold;">operator</span><span style="color: #6c3163; font-weight: bold;">()</span><span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">string</span> &amp; <span style="color: #2aa1ae; background-color: #ecf3ec;">/*</span><span style="color: #2aa1ae; background-color: #ecf3ec;">value*/</span><span style="color: #6c3163;">)</span> <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #6c3163;">{</span> <span style="color: #3a81c3; font-weight: bold;">return</span> 0.0; <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>;

<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">result</span> = <span style="color: #4e3163;">boost</span>::apply_visitor<span style="color: #3a81c3;">(</span>db_sum_visitor<span style="color: #6c3163;">()</span>, variant<span style="color: #3a81c3;">)</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6383d1b" class="outline-3">
<h3 id="org6383d1b"><span class="section-number-3">1.3</span> optional</h3>
<div class="outline-text-3" id="text-1-3">
<p>
use <code>boost::none</code> to set empty value
</p>
</div>
</div>

<div id="outline-container-orgc1e99cd" class="outline-3">
<h3 id="orgc1e99cd"><span class="section-number-3">1.4</span> tuple</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org48c4e5c" class="outline-4">
<h4 id="org48c4e5c"><span class="section-number-4">1.4.1</span> std::tie</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::tie<span style="color: #3a81c3;">(</span>i, f, d<span style="color: #3a81c3;">)</span> = some_tuple;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org902605e" class="outline-3">
<h3 id="org902605e"><span class="section-number-3">1.5</span> others</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>boost::container::small_vector</li>
<li>boost::container::stack_vector</li>
<li>boost::container::flat_map</li>
<li>boost::container::static_vector</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org535f8e2" class="outline-2">
<h2 id="org535f8e2"><span class="section-number-2">2</span> Functional</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb34c4c8" class="outline-3">
<h3 id="orgb34c4c8"><span class="section-number-3">2.1</span> bind</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>bind</code>: <b>copy</b> a value into a functional object
</p>
</div>
<div id="outline-container-org88e06e6" class="outline-4">
<h4 id="org88e06e6"><span class="section-number-4">2.1.1</span> <code>ref()</code> &amp; <code>cref()</code></h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
The <code>ref()</code> and <code>cref()</code> functions just construct an object of type <code>reference_wrapper&lt;T&gt;</code> or <code>reference_wrapper&lt;const T&gt;</code>,
which is implicitly convertible to a reference type.
</p>
</div>
</div>
<div id="outline-container-org0fb0f22" class="outline-4">
<h4 id="org0fb0f22"><span class="section-number-4">2.1.2</span> hints</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
If you are using the C++14 compiler, then use generic lambdas instead of <code>std::bind</code> and <code>boost::bind</code>, as they are less obscure and simpler to understand.
C++17 lambdas are usable with <code>constexpr</code>, unlike <code>std::bind</code> and <code>boost::bind</code>.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org0bda47f" class="outline-2">
<h2 id="org0bda47f"><span class="section-number-2">3</span> Managing Resources</h2>
</div>

<div id="outline-container-org254f9a0" class="outline-2">
<h2 id="org254f9a0"><span class="section-number-2">4</span> Utilities</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc8f7d63" class="outline-3">
<h3 id="orgc8f7d63"><span class="section-number-3">4.1</span> <a href="http://boost.org/libs/algorithm">boost::algorithm</a></h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>boost::algorithm::hex</li>
</ul>
</div>
</div>

<div id="outline-container-org15625ee" class="outline-3">
<h3 id="org15625ee"><span class="section-number-3">4.2</span> swap</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<code>boost::swap</code> first searches for a swap function in the namespace of a variable, and if there is
no matching swap function, it uses the <code>std::swap</code>.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
